Subir implementación del patrón Interpreter
